ludagoo/SearaBoom/firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# 160 MHz: USB 5 V / 500 mA headroom (Wi-Fi TX is the hog, not the CPU).
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_160=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_QUAD=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_IGNORE_NOTFOUND=y
CONFIG_SPIRAM_ALLOW_STACK_EXTERNAL_MEMORY=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=32768
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=49152

CONFIG_AUDIO_BOARD_CUSTOM=y
CONFIG_MY_BOARD_SEARABOOM=y

CONFIG_ESP_WIFI_SOFTAP_SUPPORT=y
CONFIG_LWIP_IPV6=n

CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y

CONFIG_ESP_HTTPS_OTA_ALLOW_HTTP=n
CONFIG_ESP_HTTPS_OTA_DECRYPT_CB=n

CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512

CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
CONFIG_FREERTOS_HZ=1000

# Keep I2S feeding during OTA flash writes (cache disabled).
CONFIG_I2S_ISR_IRAM_SAFE=y
CONFIG_SPI_FLASH_ERASE_YIELD_DURATION_MS=5
CONFIG_FREERTOS_ENABLE_BACKWARD_COMPATIBILITY=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384

# WS2812 / RMT
CONFIG_SOC_RMT_SUPPORTED=y

CONFIG_SEARABOOM_WIFI_SSID=""
CONFIG_SEARABOOM_WIFI_PASSWORD=""
CONFIG_LWIP_MAX_SOCKETS=16

CONFIG_SEARABOOM_OTA_URL="https://searaboom.goossen.dev"
# Prefer public HTTPS so AP client-isolation / dual-NIC LAN routing cannot block logs.
# TLS runs after stream is up; mbedtls uses PSRAM (EXTERNAL_MEM_ALLOC).
CONFIG_SEARABOOM_LOG_URL="https://searaboom.goossen.dev"
CONFIG_SEARABOOM_FW_VERSION="0.3.0"

# Default INFO; audio path stays INFO so USB-serial does not starve I2S.
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y

CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y
CONFIG_MBEDTLS_DYNAMIC_FREE_CONFIG_DATA=y
CONFIG_MBEDTLS_DYNAMIC_FREE_CA_CERT=y